tap "1password/tap"
tap "cjbassi/ytop"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "oven-sh/bun"

brew "asdf"
brew "aws-sam-cli"
brew "bun"
brew "direnv"
brew "eza"
brew "fcp"
brew "fd"
brew "fzf"
brew "git"
brew "git-secrets"
brew "go"
brew "golangci-lint"
brew "htop"
brew "jq"
brew "mas"
brew "peco"
brew "pnpm"
brew "procs"
brew "rbenv"
brew "readline"
brew "ripgrep"
brew "shellcheck"
brew "starship"
brew "stow"
brew "telnet"
brew "terminal-notifier"
brew "terraform"
brew "terraformer"
brew "terragrunt"
brew "tfenv"
brew "tig"
brew "tokei"
brew "tree"
brew "warrensbox/tap/tfswitch"
brew "warrensbox/tap/tgswitch"
brew "wget"
brew "ytop"
brew "zstd"

cask "1password-cli"
cask "1password"
cask "adobe-creative-cloud"
cask "alfred"
cask "android-studio"
cask "appcleaner"
cask "aws-vault"
cask "chromedriver"
cask "coherence-x"
cask "coteditor"
cask "cursor"
cask "deepl"
cask "discord"
cask "docker"
cask "drawio"
cask "dropbox"
cask "figma"
cask "firefox"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "gather"
cask "google-chrome"
cask "hammerspoon"
cask "insomnia"
cask "karabiner-elements"
cask "kindle"
cask "linear-linear"
cask "microsoft-edge"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "mysqlworkbench"
cask "ngrok"
cask "notion"
cask "orbstack"
cask "session-manager-plugin"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "warp"
cask "zoom"
